/* BizSimAI - German Localization */

/* Common */
"app.name" = "BizSimAI";
"common.login" = "Anmelden";
"common.logout" = "Abmelden";
"common.save" = "Speichern";
"common.cancel" = "Abbrechen";
"common.error" = "Fehler";
"common.loading" = "Laden...";
"common.success" = "Erfolg";
"common.retry" = "Erneut versuchen";
"common.submit" = "Absenden";
"common.back" = "Zurück";
"common.done" = "Fertig";
"common.delete" = "Löschen";
"common.edit" = "Bearbeiten";
"common.close" = "Schließen";

/* Authentication */
"auth.professor_login" = "Dozenten-Login";
"auth.student_access" = "Studenten-Zugang";
"auth.username" = "Benutzername";
"auth.password" = "Passwort";
"auth.student_id" = "Studenten-ID";
"auth.full_name" = "Vollständiger Name";
"auth.team_name" = "Teamname";
"auth.register" = "Registrieren & Beitreten";
"auth.sign_in_apple" = "Mit Apple anmelden";
"auth.sign_in_google" = "Mit Google anmelden";
"auth.session_expired" = "Sitzung abgelaufen. Bitte melden Sie sich erneut an.";

/* Session */
"session.create" = "Sitzung erstellen";
"session.join" = "Sitzung beitreten";
"session.code" = "Sitzungscode";
"session.round" = "Runde %d von %d";
"session.status_waiting" = "Warten auf Spieler";
"session.status_active" = "Läuft";
"session.status_completed" = "Abgeschlossen";
"session.end" = "Sitzung beenden";
"session.delete" = "Sitzung löschen";

/* Decisions */
"decision.submit" = "Entscheidungen absenden";
"decision.submitted" = "Entscheidungen eingereicht";
"decision.over_budget" = "Über Budget";
"decision.invalid" = "Ungültige Entscheidungen";

/* Results */
"results.leaderboard" = "Bestenliste";
"results.profit" = "Gewinn";
"results.revenue" = "Umsatz";
"results.market_share" = "Marktanteil";
"results.stock_price" = "Aktienkurs";
"results.cumulative" = "Kumulativ";

/* Sync */
"sync.online" = "Online";
"sync.offline" = "Offline";
"sync.syncing" = "Synchronisation...";
"sync.error" = "Synchronisation fehlgeschlagen";
"sync.saved_locally" = "Lokal gespeichert";

/* Professor */
"prof.dashboard" = "Dashboard";
"prof.sessions" = "Sitzungen";
"prof.analytics" = "Analytik";
"prof.announcements" = "Ankündigungen";
"prof.grade_mapping" = "Notenzuordnung";

/* Student */
"student.team_dashboard" = "Team-Dashboard";
"student.ai_coach" = "KI-Coach";
"student.performance" = "Leistung";

/* Navigation */
"nav.home" = "Startseite";
"nav.settings" = "Einstellungen";
"nav.profile" = "Profil";
"nav.help" = "Hilfe";

/* Errors */
"error.network" = "Netzwerkfehler. Bitte überprüfen Sie Ihre Verbindung.";
"error.server" = "Serverfehler. Bitte versuchen Sie es später erneut.";
"error.unauthorized" = "Nicht autorisiert. Bitte melden Sie sich erneut an.";
"error.not_found" = "Ressource nicht gefunden.";
